$(document).ready(function () {
  var aboutData = [
    {
      'title': '学院目标',
      'content': [
        {
          'h2': '培训“平台技术部技术人员的20%”',
          'ul': [
            '200名毕业学员',
            '达到 能力评定3级——合格水平 ',
            '能通过服务化，更好的完成标准界面开发'
          ]
        },
        {
          'h2': '培训“平台技术部技术人员的20%”',
          'ul': [
            '200名毕业学员',
            '达到能力评定3级——合格水平',
            '能通过服务化，更好的完成标准界面开发'
          ]
        },
        {
          'h2': '培训“平台技术部技术人员的20%”',
          'ul': [
            '200名毕业学员',
            '达到 能力评定3级——合格水平 ',
            '能通过服务化，更好的完成标准界面开发'
          ]
        }
      ]
    },
    {
      'title': '达成方式',
      'content': [
        {
          'h2': '达成方式达成方式达成方式',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式，达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式',
          'ul': [
            '达成方式达成方式达成方式达成方式',
            '达成方式',
            '达成方式达成方式达成方式达成方式达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式达成方式达成方式达成方式达成方式',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式达成方式达成方式达成方式'
          ]
        }
      ]
    },
    {
      'title': '衡量标准',
      'content': [
        {
          'h2': '达成方式达成方式达成方式333333',
          'ul': [
            '达成方式达成方式3333333',
            '达成方式达成方式3333',
            '达成方式，达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式',
          'ul': [
            '达成方式达成方式达成方式达成方式',
            '达成方式',
            '达成方式达成方式达成方式达成方式达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式达成方式达成方式达成方式达成方式',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式达成方式达成方式达成方式'
          ]
        }
      ]
    },
    {
      'title': '进度展示',
      'content': [
        {
          'h2': '达成方444式达成方式达成方式',
          'ul': [
            '达成方式达成方4444式',
            '达成方式达成方式',
            '达成方式，达成方式达成方式44444'
          ]
        },
        {
          'h2': '达成方式',
          'ul': [
            '达成方式达成方式达成方式达成方式4444',
            '达成方式',
            '达成方式达成方式达成方式达成方式达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式达成方式达成方式达成方式达成方式',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式达成方式达成方式达成方式'
          ]
        }
      ]
    },
    {
      'title': '技术发展小组',
      'content': [
        {
          'h2': '达成方式达成方式达成方式5555',
          'ul': [
            '达成方式达成方式5555',
            '达成方式达成方式',
            '达成方式，达成方式达成方式555'
          ]
        },
        {
          'h2': '达成方式',
          'ul': [
            '达成方式达成方式达成5555方式达成方式',
            '达成方式',
            '达成方式达成方式达成方式达成方式达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式达成方式达成方式达成方式达成方式',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式达成方式达成方式达成方式'
          ]
        }
      ]
    },
    {
      'title': '教学科',
      'content': [
        {
          'h2': '达成方式达成方式达成方式666666',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式，达66666成方式达成方式'
          ]
        },
        {
          'h2': '达成方式',
          'ul': [
            '达成方式达成方式6666达成方式达成方式',
            '达成方式',
            '达成方式达成方式达成方6666式达成方式达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式达成方式达成方式达成方式达成方式',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式达成方式达成方式达成方式'
          ]
        }
      ]
    },
    {
      'title': '教务处',
      'content': [
        {
          'h2': '达成方式达成方式达成方式77777',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式，达成方式达成方式777777'
          ]
        },
        {
          'h2': '达成方式',
          'ul': [
            '达成方式达成方式达成方式达成方式777',
            '达成方式',
            '达成方式达成方式达成方式达成方式达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式达成方式达成方式达成方式达成方式',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式达成方式达成方式达成方式'
          ]
        }
      ]
    },
    {
      'title': '服务化阵地',
      'content': [
        {
          'h2': '达成方式达成方式达成方式8888',
          'ul': [
            '达成方式达成方式888',
            '达成方式达成方式',
            '达成方式，达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式',
          'ul': [
            '达成方式达成方式达成方式达成方式',
            '达成方式',
            '达成方式达成方式达成方式达成方式达成方式达成方式'
          ]
        },
        {
          'h2': '达成方式达成方式达成方式达成方式达成方式',
          'ul': [
            '达成方式达成方式',
            '达成方式达成方式',
            '达成方式达成方式达成方式达成方式'
          ]
        }
      ]
    }
  ];

  function switchContent(index) {
    var data = aboutData[index];
    var tempDom = '';
    tempDom += '<h1>' + data.title + '</h1>';
    for (var i = 0, l = data.content.length; i < l; i++) {
      tempDom += '<div><h2>' + data.content[i].h2 + '</h2><ul>';
      for (var m = 0, n = data.content[i].ul.length; m < n; m++) {
        tempDom += '<li>' + data.content[i].ul[m] + '</li>';
      }
      tempDom += '</ul></div>';
    }
    $('.right-bar').html(tempDom);
  }

  switchContent(0);

  $('.left-bar > p').each(function (index) {
    $(this).click(function () {
      if (!$(this).hasClass('active')) {
        $('.left-bar > p').removeClass('active');
        $(this).addClass('active');
        $('.right-bar').animate({opacity: 0}, 200, function () {
          switchContent(index);
        });
        $('.right-bar').animate({opacity: 1}, 300);
      }
    });
  });

});